v2206/atmospheric_AloisLuggerPlatz/trees/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    // p_rgh
    // {
    //     // solver          PCG;
    //     // preconditioner  DIC;
    //     // tolerance       1e-6;
    //     // relTol          0.01;

    //     solver          GAMG;
    //     smoother        GaussSeidel;
    //     tolerance       1e-6;
    //     relTol          0.01;


    // }

    // p_rghFinal
    // {
    //     $p_rgh;
    //     relTol          0;
    // }

    p_rgh
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.1;
        smoother        DICGaussSeidel;
        maxIter         50;
    };

    p_rghFinal
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-6;
            relTol          0;
            nVcycles        2;
            smoother        DICGaussSeidel;

        };
        tolerance       1e-7;
        relTol          0;
        maxIter         50;
    };

    "(U|T|k|epsilon|omega|R)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|T|k|epsilon|omega|R)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    equations
    {
        "(U|T|k|epsilon|R)" 0.9;
        "(U|T|k|epsilon|R)Final" 0.9;
    }
}


// ************************************************************************* //
