v2206/atmospheric_AloisLuggerPlatz/trees/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version 	2.0;
	format		ascii;
	class 		dictionary;
	location	"system";
	object 		fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dragSource1
{
    type            actuationDiskSource;
    selectionMode   cellSet;
    cellSet         dragZone1;
    Cp              0.55;
    Ct              0.58;
    diskArea        20;
    diskDir         (1 0 0);  // Or other Function1
    upstreamPoint   (250 40 125);
}

// momentumSource
// {
//     type    		meanVelocityForce;
//     active  		yes;
//     selectionMode   all;
//     fields          (U);
//     Ubar            (3 0 0);
//     relaxation		0.9;
// }
