v2206/atmospheric_AloisLuggerPlatz/trees/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    // dragSource1
    {
        name    dragSource1CellSet;
        type    cellSet;
        action  new;
        source  boxToCell;  
        box     (245 35 120) (255 45 130);
    }
    {
        name    dragZone1;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     dragSource1CellSet;
    }


    // LEGACY
    // {
    //     name         searchableSurface;
    //     type         faceZoneSet; // faceSet; // faceZoneSet; // pointSet;
    //     action       new;
    //     source       searchableSurfaceToFaceZone; // searchableSurfaceToFace;
    //                                           // searchableSurfaceToFaceZone;
    //                                           // searchableSurfaceToPoint;
    //     surfaceType  triSurfaceMesh;
    //     surfaceName  grass.obj;
    // }

);


// ************************************************************************* //
